from bot.utils.config import CHANNEL_URL

START_TEXT = """Для начала давай убедимся, что ты являешься резидентом клуба Pride😎
Проверь свою подписку на этот канал👇"""

TEXT_1 = """Привет, меня зовут Pride assistant⚡️

Я твой личный ассистент для быстрых решений  от бизнес клуба Pride Community💣 

Чем я могу быть полезен?

- Отвечу на любой вопрос.
- Могу прочитать любые документы и договора.
- Создаю любые текста, посты и шаблоны, по твоему запросу.
- Генерирую идеи, гипотезы и решения  на твой вопрос.
- Выхожу в интернет и нахожу нужную информацию.
- Могу ставить напоминалки прямо в чате на определенное время и дату. 


Буду очень рад, быть тебе полезным и ускорять твои личные и рабочие процессы 🤝🏽 

Ну что начнём? Я уже готов решить твой запрос⚡️

Напиши мне, с чем тебе требуется помощь👇"""

TEXT_2 = "Сначала подпишись на канал"
TEXT_3 = "Вы создали новый чат, для начала общения напишите что нибудь!"
TEXT_4 = "это ваш профиль."
TEXT_5 = "Подписка:"
TEXT_6 = "Покупка подписки"
TEXT_7 = "Подписка на бота"
TEXT_8 = "Активация подписки на бота на 1 месяц"
TEXT_9 = "Оплата прошла успешно, вы получаете подписку!"
TEXT_10 = "Лимиты"
TEXT_11 = "Вы израсходовали"
TEXT_12 = "запросов."
TEXT_13 = "Лимиты обновляются в 00:00 по московскому времени."
TEXT_14 = "Произошла ошибка. Пожалуйста, попробуйте позже."
TEXT_15 = "Кажется, вы не подписаны, попробуйте еще раз"
TEXT_16 = "Вы зашли в админ панель. Чтобы совершить действие над конкретным пользователем выберите поиск."
TEXT_17 = "Поиск по юзернейму или ID пользователя"
TEXT_18 = "Введите юзернейм пользователся без @"
TEXT_19 = "Введите id пользователся"
TEXT_20 = "К сожалению дневные лимиты израсходованы, оформите подписку или возвращайтесь завтра"
TEXT_21 = "К сожалению дневные лимиты израсходованы, возвращайтесь завтра"
TEXT_22 = "Такого юзера нет, попробуйте еще раз"
TEXT_23 = "Юзер забанен, ID: "
TEXT_24 = "Установлена обычная подписка для ID: "
TEXT_25 = "Установлена платная подписка для ID: "
TEXT_26 = "Юзер разбанен, ID: "
TEXT_27 = '''Нажимая на кнопку "Продолжить" вы подтверждаете, что ознакомились с [Пользовательским 
соглашением](https://docs.google.com/document/d/1ykgiTysZ57iCB9gXT7RpxfYMQ7AQTte6/edit) и правилами 
предоставления доступа к Ассистентy'''
TEXT_28 = "Ошибка при конвертации голосового сообщения, попробуйте позже."


INLINE_1 = "Канал"
INLINE_2 = "Я подписался ✅"
INLINE_3 = "Диалог с ChatGPT"
INLINE_4 = "Мой профиль"
INLINE_5 = "Начать новый диалог"
INLINE_6 = "Назад в меню"
INLINE_7 = "Купить подписку"
INLINE_8 = "Поиск пользователя"
INLINE_9 = "Выгрузить базу данных"
INLINE_10 = "Поиск по юзернейму"
INLINE_11 = "Поиск по id"
INLINE_12 = "Назад"
INLINE_13 = "Сделать платную подписку"
INLINE_14 = "Забанить"
INLINE_15 = "Назад в меню"
INLINE_16 = "Назад к юзеру"
INLINE_17 = "Разбанить"
INLINE_18 = "Сделать бесплатную подписку"
INLINE_19 = "Изменение подписки недоступно"
INLINE_20 = "✅ Продолжить"
INLINE_21 = ""
INLINE_22 = ""
INLINE_23 = ""
INLINE_24 = ""
INLINE_25 = ""
INLINE_26 = ""



REPLY_1 = "Button"